// @strict-types


#Область ПрограммныйИнтерфейс

// Проверить актуальность зарегистрированных баз.
// 
// Параметры:
//  Кластер - СправочникСсылка.Кластеры1С
//  ИдентификаторыБаз - УникальныйИдентификатор
Процедура ПроверитьАктуальностьЗарегистрированныхБаз(Кластер, ИдентификаторыБаз) Экспорт
	
	// REF
	Справочники.ПравилаПроверкиОбъектов.Проверить_АктуальностьЗарегистрированныхБаз(Кластер, ИдентификаторыБаз);
		
КонецПроцедуры

// Проверить доступность серверов.
Процедура ПроверитьДоступностьСерверов() Экспорт
	
	// REF
	Справочники.ПравилаПроверкиОбъектов.Проверить_ДоступностьСерверов() ;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


// Записать результат проверки.
// 
// Параметры:
//  ОбъектКластера - СправочникСсылка.ИнформационныеБазы,
//			 - СправочникСсылка.Кластеры1С,
//  		 - 	СправочникСсылка.СерверыБД,
//  		 - 	СправочникСсылка.ПользователиИБ,
//  		 - 	СправочникСсылка.ВебСерверы,
//  		 - 	СправочникСсылка.ХранилищаКонфигураций - Объект информацио о проверке которого записывается
//  		 
//  Правило - СправочникСсылка.ПравилаПроверкиОбъектов - Правило
Процедура ЗаписатьРезультатПроверки(ОбъектКластера, Правило, ПроеверкаПройдена = Ложь) Экспорт
	
	РегистрыСведений.ПроверкиОбъектов.ЗаписатьРезультатПроверки(ОбъектКластера, Правило, ПроеверкаПройдена);
		
КонецПроцедуры

#КонецОбласти

