

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПортКластераПредставление = Формат(Объект.ПортКластера, "ЧЦ=5; ЧГ=;");
	ПортСервераАдминистрированияПредставление = Формат(Объект.ПортСервераАдминистрирования, "ЧЦ=5; ЧГ=;");

КонецПроцедуры


&НаКлиенте
Процедура АктивенПриИзменении(Элемент)
	
	Если Модифицированность Тогда
		Записать();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗащищенПриИзменении(Элемент)
	
	Если Модифицированность Тогда
		Записать();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетчикПотребленияРесурсовПриИзменении(Элемент)
	
	Если Модифицированность Тогда
		Записать();		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуЭлемента(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.Ссылка);
	ОткрытьФорму("Справочник.Кластеры1С.Форма.ФормаЭлемента", ПараметрыФормы );
	
КонецПроцедуры



