 
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения); 
	КоличествоДнейИспользования = 1;
	
	Если ЗначениеЗаполнено(Параметры.Кластер1С) Тогда
		Объект.Владелец = Параметры.Кластер1С;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Элементы.Кластер1С.Видимость = Ложь;
	Иначе
		Элементы.Кластер1СПредставление.Видимость = Ложь;
	КонецЕсли;
	
	Объект.Проект = Параметры.Проект;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Модифицированность = Ложь;
	ПриЗакрытииПомощника(Отказ);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриЗакрытииПомощника(Отказ)
	
	ОжиданиеОтветаНаВопрос = ВопросАсинх("Закрыть помощник создания информационной базы?", РежимДиалогаВопрос.ДаНет, , , , );
	
	Результат = Ждать ОжиданиеОтветаНаВопрос;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхБазыПриИзменении(Элемент)
	
	МассивСтраниц = Новый Массив;
	МассивСтраниц.Добавить("ГруппаПустаяБаза");
	МассивСтраниц.Добавить("ГруппаКопияБазы");
	МассивСтраниц.Добавить("ГруппаНоваяБаза");
	МассивСтраниц.Добавить("ГруппаДемоБаза");
	
	ИмяТекущейСтраницы = МассивСтраниц[ИсточникДанныхБазы];
	Элементы.СтраницыВыбораИсточника.ТекущаяСтраница = Элементы[ИмяТекущейСтраницы];

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеПараметрыДалее(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.ДополнительныеПараметры;

КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеПараметрыДалее(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.СтраницаПостЗаполнения;
	
КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеПараметрыНазад(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.ОсновныеПараметры;

КонецПроцедуры


&НаКлиенте
Процедура ПостЗаполнениеНазад(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.ДополнительныеПараметры;

КонецПроцедуры

&НаКлиенте
Процедура ПостЗаполнениеДалее(Команда)

	Если ИсточникДанныхБазы = 0 И Объект.ВебСерверы.Количество() = 0 Тогда
		Элементы.СтраницыСценарииПусто.ТекущаяСтраница = Элементы.ПустойСценарий;
	Иначе
		Элементы.СтраницыСценарииПусто.ТекущаяСтраница = Элементы.Сценарий;
	КонецЕсли;
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.СтраницаСценария;

КонецПроцедуры

&НаКлиенте
Процедура СценарииНазад(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.СтраницаПостЗаполнения;

КонецПроцедуры











 
&НаКлиенте
Процедура КоличествоДнейИспользованияПриИзменении(Элемент)
	
	ОтобразитьДнейИспользования();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьДнейИспользования()
	
	Элементы.КоличествоДнейИспользования.Заголовок = "Срок использования (" + Строка(КоличествоДнейИспользования) + " дн.)";
	Объект.ИспользуетсяПо = НачалоДня(ТекущаяДата()) + КоличествоДнейИспользования * 24*60*60;	

КонецПроцедуры // ОтобразитьДнейИспользования()

&НаКлиенте
Процедура ПриОткрытии(Отказ)     
	
	ОтобразитьДнейИспользования();
	
КонецПроцедуры
