
#Область ОбработчикиКомандФормы

#КонецОбласти


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ЭлементыКонтекста) = Тип("Структура") И ЗначениеЗаполнено(Параметры.ЭлементыКонтекста) Тогда
		СоздатьЭлементыФормы(Параметры.ЭлементыКонтекста);
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Состав контекста отсутствует!");
	КонецЕсли;
	
КонецПроцедуры

// Создает Элементы формы в соответствии с контектсом скрипта
//
// Параметры:
//  ЭлементыКонтекста  - <Структура> - <описание параметра>
//                 <продолжение описания параметра>
&НаСервере
Процедура СоздатьЭлементыФормы(ЭлементыКонтекста)

	//Создание реквизитов
	ДобавляемыеРеквизиты = Новый Массив;
	СчетчикДублей = Новый Соответствие;
	
	Для Каждого ЭлементКонтекста Из ЭлементыКонтекста Цикл
		
		ТипЗначения = ЭлементКонтекста.Значение.ТипЗначения;
		ИмяЭлемента = ЭлементКонтекста.Ключ;
		
		ЗначениеСчетчика = СчетчикДублей.Получить(ЭлементКонтекста.Значение);
		Если ЗначениеСчетчика = Неопределено Тогда
			СчетчикДублей.Вставить(ЭлементКонтекста.Значение, 0);
			НомерПоПорядку = "";
		Иначе
			НомерПоПорядку = " (" + (ЗначениеСчетчика + 1) +")";
			СчетчикДублей[ЭлементКонтекста.Значение] = ЗначениеСчетчика + 1;
		КонецЕсли;
		
		ЗаголовокоЭлемента = ЭлементКонтекста.Значение.Наименование + НомерПоПорядку;
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяЭлемента, ТипЗначения, , ЗаголовокоЭлемента);
		
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	//Создание полей
	Для Каждого ЭлементКонтекста Из ЭлементыКонтекста Цикл
		
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"));
		НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным		= ЭлементКонтекста.Ключ; 
		НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх; 
		
	КонецЦикла;
	
КонецПроцедуры // СоздатьЭлементыФормы()

&НаКлиенте
Процедура ОК(Команда)
	
	ЗначенияКонтектста = Новый Структура;
	
	Для Каждого ЭлементКонтекста Из Элементы Цикл
		Если ТипЗнч(ЭлементКонтекста) = Тип("ПолеФормы") Тогда
			ЗначенияКонтектста.Вставить(ЭлементКонтекста.Имя, ЭтотОбъект[ЭлементКонтекста.Имя]);
		КонецЕсли;
	КонецЦикла; 
	
	Оповестить("ЗаполнениеПараметровСкрипта", ЗначенияКонтектста); 
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры






