
&НаКлиенте
Процедура КомандаЗагрузитьКонфигурации(Команда)
	
	ЗагрузитьСписокКонфигураций();

КонецПроцедуры
// @strict-types

&НаСервере
Процедура ЗагрузитьСписокКонфигураций()
	
	АдминистрированиеЭлементовКластера.ЗагрузитьКонфигурации();
	
КонецПроцедуры

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
