


Функция ПолучитьСерверПоИмени(АдминистрированиеИнформационнойБазы, СоздаватьПриОтсутствии = Ложь) Экспорт
	
	ИмяСервера = АдминистрированиеИнформационнойБазы.СерверБазДанных;
	
	Если ПустаяСтрока(ИмяСервера) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ЗначениеЗаполнено(АдминистрированиеИнформационнойБазы.СУБД) Тогда
		ТипСУБД = Перечисления.ТипыСУБД[АдминистрированиеИнформационнойБазы.СУБД];
	Иначе
		ТипСУБД = Неопределено
	КонецЕсли;
	
	НайденныйСервер = НайтиПоРеквизиту("ИмяСервера", ИмяСервера);
	
	Если Не ЗначениеЗаполнено(НайденныйСервер) И СоздаватьПриОтсутствии Тогда
		НовыйСервер = СоздатьЭлемент();
		НовыйСервер.Наименование	= ИмяСервера;
		НовыйСервер.ИмяСервера		= ИмяСервера;
		НовыйСервер.ТипСУБД			= ТипСУБД;
		НовыйСервер.Записать();
		
		НайденныйСервер = НовыйСервер.Ссылка;
		
		Правило = Справочники.ПравилаПроверкиОбъектов.ЗаполнениеДанныхСУБД;
		ПроверкаСостоянияОбъектов.ЗаписатьРезультатПроверки(НайденныйСервер, Правило);
		
	КонецЕсли; 
	
	Возврат НайденныйСервер;
	
КонецФункции