


Функция ПолучитьСерверПоИмени(АдминистрированиеИнформационнойБазы, ОбновитьДанныеСУБД = Ложь) Экспорт
	
	ИмяСервера = АдминистрированиеИнформационнойБазы.СерверБазДанных;
	
	Если ПустаяСтрока(ИмяСервера) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ЗначениеЗаполнено(АдминистрированиеИнформационнойБазы.СУБД) Тогда
		ТипСУБД = Перечисления.ТипыСУБД[АдминистрированиеИнформационнойБазы.СУБД];
	Иначе
		ТипСУБД = Неопределено
	КонецЕсли;
	
	НайденныйСервер = НайтиПоРеквизиту("ИмяСервера", ИмяСервера);
	
	Если ОбновитьДанныеСУБД Тогда
		
		Если Не ЗначениеЗаполнено(НайденныйСервер) Тогда
			СерверСУБДОбъект = СоздатьЭлемент();
		Иначе
			СерверСУБДОбъект = НайденныйСервер.ПолучитьОбъект();
		КонецЕсли;
		
		СерверСУБДОбъект.Наименование		= ИмяСервера;
		СерверСУБДОбъект.ИмяСервера		= ИмяСервера;
		СерверСУБДОбъект.ТипСУБД			= ТипСУБД;
		СерверСУБДОбъект.Записать();
		
		НайденныйСервер = СерверСУБДОбъект.Ссылка;
		
		Правило = Справочники.ПравилаПроверкиОбъектов.ЗаполнениеДанныхСУБД;
		ПроверкаСостоянияОбъектов.ВыполнитьПроверкуОбъекта(НайденныйСервер, Правило);
		
	КонецЕсли; 
	
	Возврат НайденныйСервер;
	
КонецФункции