// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций


&НаКлиенте
Процедура Удалить(Команда)
	
	УдалитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	
	РежимУдаления = Неопределено;
	
	Если РежимУдаленияБазыДанных = 0 Тогда
		 
		РежимУдаления = АдминистрированиеРежимУдаленияИнформационнойБазы.УдалитьБазуДанных;
		
	ИначеЕсли РежимУдаленияБазыДанных = 1 Тогда
		 
		РежимУдаления = АдминистрированиеРежимУдаленияИнформационнойБазы.ОчиститьБазуДанных;
		
	ИначеЕсли РежимУдаленияБазыДанных = 2 Тогда
		 
		РежимУдаления = АдминистрированиеРежимУдаленияИнформационнойБазы.НеВыполнятьДействийСБазойДанных;
		
	КонецЕсли;
	
	// TODO: Выполнить в фоне
	АдминистрированиеЭлементовКластера.УдалитьИнформационнуюБазу(Объект.Ссылка, РежимУдаления, УдалитьКаталогКЭШа);
		
EndProcedure

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
