
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСБуферомОбменаКлиентСервер.ДобавитьЭлементыФормыДляHTMLБуфера(ЭтотОбъект, Элементы);

КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.ПутьККаталогу);

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЗначениеВБуфер(Значение)

	РаботаСБуферомОбменаКлиентСервер.СкопироватьВБуферОбмена(Значение, ЭтотОбъект["ПолеHTMLБуфера"]);

КонецПроцедуры // СкопироватьЗначениВБуфер()

// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций


&НаКлиенте
Процедура ОткрытьФормуРедактирования(Команда)
	
	Закрыть();
	ОткрытьФорму("Справочник.Конфигурации.Форма.ФормаЭлемента", Новый Структура("Ключ", Объект.Ссылка));

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
